snlkuharlocal/src/Documents/ЗаявкаНаРекламацию/ЗаявкаНаРекламацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРекламацию</name>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРекламации</name>
    <type>
      <types>CatalogRef.ПричиныРекламаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.АктПриемки</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаявки</name>
    <type>
      <types>EnumRef.СостоянияКоррекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРекламации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРекламации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРекламации</name>
      <type>
        <types>CatalogRef.ПричиныРекламаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗаявки</name>
      <type>
        <types>EnumRef.СостоянияКоррекции</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФактСогласовано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоСогласовано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДельтаСогласовано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/ПолномочияПользователей/ПолномочияПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолномочияПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Полномочие</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПолномочияПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НастройкиПоУмолчанию</name>
      <description>Настройки по умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонВнутренний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонГородской</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньДоступа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяWindows</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Интерфейс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеСклады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>РедактированиеДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПросмотрДокументов</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаСоСклада</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриемкаНаСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеОрганизации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДатыЗапрета</name>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодРедактирования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заместители</name>
    <attributes>
      <name>Заместитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеПодразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеВидыОтчетов</name>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>CatalogRef.ВидыОтчетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеСостоянияДокументов</name>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостояниеДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ЗаявкаНаРекламацию/ManagerModule.bsl
Функция СоздатьДокументРекламационнаяНакладная(ДокСсылка, ДополнительныеРеквизиты = Неопределено, Проводить = Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокСсылка) Тогда Возврат Неопределено; КонецЕсли;
	
	ДокРекламация = СоздатьИзменитьДокумент(ДокСсылка, "РекламационнаяНакладная");
	Если ДокРекламация <> Неопределено Тогда
		
		ЗаполнитьШапкуДокумента(ДокРекламация, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Покупка");
		
		ДокРекламация.Заполнить(ДокСсылка);
		
		Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Структура") Тогда
			Для Каждого Элемент из ДополнительныеРеквизиты Цикл
				//УстановитьНезаполненныйРеквизитШапки(ДокРекламация, Элемент.Ключ, Элемент.Значение);
				Если ЕстьРеквизитДокумента(Элемент.Ключ, ДокРекламация.Метаданные()) Тогда
					ДокРекламация[Элемент.Ключ] = Элемент.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Попытка
			Если Проводить Тогда
				ДокРекламация.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокРекламация.ОбменДанными.Загрузка = Истина;
				ДокРекламация.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			СообщитьИзМодуля("" + Строка(ДокРекламация));
			Возврат ДокРекламация.Ссылка;		
		Исключение
			ДокРекламация.ОбменДанными.Загрузка = Истина;
			ДокРекламация.Записать(РежимЗаписиДокумента.Запись);
			СообщитьИзМодуля(ОписаниеОшибки());
			Возврат ДокРекламация.Ссылка;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СоздатьИзменитьДокумент(ДокСсылка = Неопределено, ВидДокумента = "РекламационнаяНакладная", ФлагТолькоПроведенные = Ложь, ФлагБезПомеченныхНаУдаление = Истина, СоздаватьНовый = Ложь) Экспорт
	
	Если ДокСсылка = Неопределено ИЛИ СоздаватьНовый Тогда
		НовыйДок = Неопределено;
	Иначе
		НовыйДок = ЗаполнениеДокументов.НайтиПодчиненныйДокумент(ДокСсылка, ВидДокумента, ФлагТолькоПроведенные, ФлагБезПомеченныхНаУдаление);
	КонецЕсли;
	
	Если НовыйДок = Неопределено Тогда
		НовыйДокОбъект = Документы[ВидДокумента].СоздатьДокумент();
		НовыйДокОбъект.Дата = ТекущаяДатаСеанса();
		КодИБ = ПараметрыСеанса.ЭтотУзел.Код;
		НовыйДокОбъект.УстановитьНовыйНомер(КодИБ + "-");		
	Иначе
		НовыйДокОбъект = НовыйДок.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат НовыйДокОбъект;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Процедура СформироватьОтбивку(ДокСсылка, ТекстОтбивки = "", Полномочие = "ДокументКоррекцияОбработка", Автор = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Если ТипЗнч(Полномочие)=Тип("Строка") Тогда
		Полномочие=ПланыВидовХарактеристик.ПолномочияПользователей[Полномочие];	
	КонецЕсли;	
	Запрос.УстановитьПараметр("Полномочие"   , Полномочие);
	Запрос.УстановитьПараметр("Автор" , Автор);
	Если Автор = Неопределено Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ПолномочияПользователей.Пользователь.ФизЛицо.ЕМэйл КАК СТРОКА(100)) КАК ЕМэйл
		|ИЗ
		|	РегистрСведений.ПолномочияПользователей КАК ПолномочияПользователей
		|ГДЕ
		|	ПолномочияПользователей.Полномочие = &Полномочие
		|	И (ВЫРАЗИТЬ(ПолномочияПользователей.Пользователь.ФизЛицо.ЕМэйл КАК СТРОКА(100))) <> """"
		|	И ПолномочияПользователей.Значение = ИСТИНА
		|";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(Пользователи.ФизЛицо.ЕМэйл КАК СТРОКА(100)) КАК Емэйл
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Автор
		|	И НЕ Пользователи.ПометкаУдаления
		|	И (ВЫРАЗИТЬ(Пользователи.ФизЛицо.ЕМэйл КАК СТРОКА(100))) <> """"
		|";
	КонецЕсли;
	
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЕМэйл");
	СписокПолучателей = Новый СписокЗначений;
	Для Каждого Элемент Из Массив Цикл
		СписокПолучателей.Добавить(Элемент);	
	КонецЦикла;
	
	Если СписокПолучателей.Количество() > 0 Тогда
		
		ТекстПисьма = "Документ " + Строка(ДокСсылка) + ". " + ТекстОтбивки;
		
		СформироватьВнутреннееУведомление(СписокПолучателей, ТекстПисьма, ТекстПисьма, ДокСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция СоздатьДокументКорректировочнаяСФ(РекламацияСсылка) Экспорт
	
	КСФ = КСчетФактураНакладной(РекламацияСсылка);
	
	Если КСФ.Пустая() Тогда
		КСФ_Объект = Документы.КорректировочныйСчетФактура.СоздатьДокумент();
	Иначе
		КСФ_Объект = КСФ.Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьШапкуДокумента(КСФ_Объект, ПараметрыСеанса.Пользователь, ПараметрыСеанса.ВалютаНац, "Продажа");
	
	КСФ_Объект.Дата = ТекущаяДатаСеанса();
	
	КСФ_Объект.Заполнить(РекламацияСсылка);
	
	УстановитьНомерДокументаКлиентСервер(КСФ_Объект);
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Попытка
		КСФ_Объект.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		СообщитьИзМодуля("" + Строка(КСФ_Объект));
	Исключение
		КСФ_Объект.ОбменДанными.Загрузка = Истина;
		КСФ_Объект.Записать(РежимЗаписиДокумента.Запись);
		СообщитьИзМодуля(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ?(КСФ_Объект = Неопределено, Неопределено, КСФ_Объект.Ссылка);
	
КонецФункции
